simplementeUnPorito/Tesis-firmware-psoc/Serial_HAMMER/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "timer_clock_5.h"
#include "Tmr_LedWait.h"
#include "DMA_DelSig_RAM_dma.h"
#include "DMA_DelSig_Filter_dma.h"
#include "timer_clock_3.h"
#include "DMA_Filter_RAM_dma.h"
#include "Filter.h"
#include "Filter_PVT.h"
#include "timer_clock.h"
#include "UART.h"
#include "SYNC_IN_aliases.h"
#include "SYNC_IN.h"
#include "EEPROM.h"
#include "Tmr_UartRxWatchdog.h"
#include "isr_SuperMaquina.h"
#include "state.h"
#include "error.h"
#include "status.h"
#include "reset.h"
#include "cfg.h"
#include "ctrl.h"
#include "timer_clock_4.h"
#include "Tmr_PingCalTick.h"
#include "Tmr_CaptureWatchdog.h"
#include "LED_aliases.h"
#include "LED.h"
#include "tmr_event.h"
#include "SPIp_aliases.h"
#include "SPIp.h"
#include "AMux_Capacitor_aliases.h"
#include "AMux_Capacitor.h"
#include "ref1V_aliases.h"
#include "ref1V.h"
#include "Opa_ref_1V.h"
#include "Opa_ref_PGA.h"
#include "AMux_ADC.h"
#include "VDAC_LP.h"
#include "LPo_aliases.h"
#include "LPo.h"
#include "LPm_aliases.h"
#include "LPm.h"
#include "Opa_LP.h"
#include "LPF_ADC.h"
#include "ADC.h"
#include "PGAo_aliases.h"
#include "PGAo.h"
#include "PGA.h"
#include "VDAC_PGA.h"
#include "PGAin_aliases.h"
#include "PGAin.h"
#include "SPI.h"
#include "SPI_PVT.h"
#include "Button_aliases.h"
#include "Button.h"
#include "Clock_1.h"
#include "UART_IntClock.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_Bypass_P03_aliases.h"
#include "ADC_Bypass_P03.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "SPI_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

